tests/xml/soap.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:weat="http://ws.cdyne.com/WeatherWS/">
	<soap:Header>
		<sid>78944112224554</sid>
	</soap:Header>
	<soap:Body>
		<weat:GetWeatherInformation />
	</soap:Body>
</soap:Envelope>